# Bibliotecas

In [ ]:
"""
create table Produtos(
    ID INT,
    Name NVARCHAR(255),
    Price money,
    Id_Category INT
)
"""

'\ncreate table Produtos(\n    ID INT,\n    Nome NVARCHAR(255),\n    Price money,\n    Id_Category INT\n)\n'

In [19]:
#!pip install pyodbc 

import pandas as pd
import pyodbc 

server = 'DESKTOP-22ULELT' # Substitua pelo nome do servidor SQL Server
database = 'Python'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando

#### Conexão com senha

In [ ]:
"""
server = 'DESKTOP-22ULELT' # Substitua pelo nome do servidor SQL Server
database = 'Produtos'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      f'usuario= Silvio;'
                      f'senha=1989;'                      
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando
"""

In [21]:
dados = pd.read_excel(r"C:\Users\silvio\Documents\Curso BD\Udemy\Arquivos\05.+SQL+Server\05. SQL Server\Origem\Origem\arquivos_excel\Produto.xlsx")
#display(dados)
dados.head(5)
#display(dados)

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

In [22]:
dados.columns

Index(['ID', 'Name', 'Price', 'Id_Category'], dtype='object')

In [23]:
str(dados.columns).replace("'","") #Substitui ou retirar as aspas

'Index([ID, Name, Price, Id_Category], dtype=object)'

In [24]:
#Conversão de dados
#df['Nome'] = df.Nome.astype(str)  ##conversao de dados para string nvarchar

# Inserindo DataFrame no Banco

In [27]:
dados.head(5)

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

In [30]:
for index, linha in dados.iterrows():
           #variável 'linha' recebe tabela .xlsx dentro de 'dados' com a função iterrows 
     cursor.execute("Insert into [Produtos](ID,Name,Price,Id_Category)values(?,?,?,?)",linha.ID,linha.Name,linha.Price,linha.Id_Category) 
     # inserir colunas e quantas colunas tiver passar quantidade de ??
cursor.commit()   # validar dados no SQL Server
cursor.close()    #Fechar Cursor
conexaoDB.close() #Fechar Conexao

In [ ]:
#cursor.execute('delete  from [dbo].[Dim_Produto]')   #executa tarefa de  apagar dados
#cursor.commit()